#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Directory 📖`vpc`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/mavenlink/vpc-dev/runs/run-p9vPqif7yaHdc7Z6

Waiting for the plan to start...

Terraform v0.14.2
Configuring remote state backend...
Initializing Terraform configuration...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-01bd0b5a231dbdf62]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-07a1c445dfc56932d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-08b7dca4398ae2cb8]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0702b5826e51e1d9f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0820a71dcd9cf5725]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0dcfd7f25edd4ae8c]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0ec6fab32e29e22ba]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-02f7596301c270702]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0451c7f442962d316]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-05b31293c135bb820]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-05b31293c135bb8201080289494]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "tf-cloud-vpc-us-west-1a"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.vpc.aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "tf-cloud-vpc-us-west-1b"
          + "Terraform"   = "true"
        }
      + vpc                  = true
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "tf-cloud-vpc-us-west-1a"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Environment" = "dev"
          + "Name"        = "tf-cloud-vpc-us-west-1b"
          + "Terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = "rtb-0820a71dcd9cf5725"
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block     = "0.0.0.0/0"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + local_gateway_id           = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = "rtb-02f7596301c270702"
      + state                      = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[2] will be destroyed
  - resource "aws_route_table" "private" {
      - id               = "rtb-0451c7f442962d316" -> null
      - owner_id         = "805165820212" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "tf-cloud-vpc-private-us-west-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-01bd0b5a231dbdf62" -> null
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-0820a71dcd9cf5725"
      + subnet_id      = "subnet-07a1c445dfc56932d"
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = "rtb-02f7596301c270702"
      + subnet_id      = "subnet-08b7dca4398ae2cb8"
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-05b31293c135bb820"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = "rtb-05b31293c135bb820"
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                             = "arn:aws:ec2:us-west-1:805165820212:subnet/subnet-0dcfd7f25edd4ae8c" -> (known after apply)
      ~ availability_zone_id            = "usw1-az3" -> (known after apply)
      ~ cidr_block                      = "10.0.101.0/24" -> "10.0.201.0/24" # forces replacement
      ~ id                              = "subnet-0dcfd7f25edd4ae8c" -> (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      ~ owner_id                        = "805165820212" -> (known after apply)
        tags                            = {
            "Environment" = "dev"
            "Name"        = "tf-cloud-vpc-public-us-west-1a"
            "Terraform"   = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # module.vpc.aws_subnet.public[1] must be replaced
-/+ resource "aws_subnet" "public" {
      ~ arn                             = "arn:aws:ec2:us-west-1:805165820212:subnet/subnet-0ec6fab32e29e22ba" -> (known after apply)
      ~ availability_zone_id            = "usw1-az1" -> (known after apply)
      ~ cidr_block                      = "10.0.102.0/24" -> "10.0.201.0/24" # forces replacement
      ~ id                              = "subnet-0ec6fab32e29e22ba" -> (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      ~ owner_id                        = "805165820212" -> (known after apply)
        tags                            = {
            "Environment" = "dev"
            "Name"        = "tf-cloud-vpc-public-us-west-1b"
            "Terraform"   = "true"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 12 to add, 0 to change, 3 to destroy.
```

</details>

*Pusher: @patelroshan21, Action: `pull_request`*